Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4SP32A.xml
        <register caption="Channel Enable Register" name="ADC_CHER" offset="0x10" rw="W" size="4">
          <bitfield caption="Channel 0 Enable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Enable" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Enable" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Enable" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Enable" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Enable" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Enable" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Enable" mask="0x00000080" name="CH7"/>
          <bitfield caption="Channel 8 Enable" mask="0x00000100" name="CH8"/>
          <bitfield caption="Channel 9 Enable" mask="0x00000200" name="CH9"/>
        </register>
        <register caption="Channel Disable Register" name="ADC_CHDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Channel 0 Disable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Disable" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Disable" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Disable" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Disable" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Disable" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Disable" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Disable" mask="0x00000080" name="CH7"/>
          <bitfield caption="Channel 8 Disable" mask="0x00000100" name="CH8"/>
          <bitfield caption="Channel 9 Disable" mask="0x00000200" name="CH9"/>
        </register>
        <register caption="Channel Status Register" name="ADC_CHSR" offset="0x18" rw="R" size="4">
          <bitfield caption="Channel 0 Status" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Status" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Status" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Status" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Status" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Status" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Status" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Status" mask="0x00000080" name="CH7"/>
          <bitfield caption="Channel 8 Status" mask="0x00000100" name="CH8"/>
          <bitfield caption="Channel 9 Status" mask="0x00000200" name="CH9"/>
        </register>
        <register caption="Last Converted Data Register" name="ADC_LCDR" offset="0x20" rw="R" size="4">
          <bitfield caption="Last Data Converted" mask="0x00000FFF" name="LDATA"/>
          <bitfield caption="Channel Number" mask="0x0000F000" name="CHNB"/>
        </register>
        <register caption="Interrupt Enable Register" name="ADC_IER" offset="0x24" rw="W" size="4">
          <bitfield caption="End of Conversion Interrupt Enable 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Enable 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Enable 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Enable 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Enable 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Enable 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Enable 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Enable 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="End of Conversion Interrupt Enable 8" mask="0x00000100" name="EOC8"/>
          <bitfield caption="End of Conversion Interrupt Enable 9" mask="0x00000200" name="EOC9"/>
          <bitfield caption="End of Calibration Sequence" mask="0x00800000" name="EOCAL"/>
          <bitfield caption="Data Ready Interrupt Enable" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Enable" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Enable" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x10000000" name="RXBUFF"/>
        </register>
        <register caption="Interrupt Disable Register" name="ADC_IDR" offset="0x28" rw="W" size="4">
          <bitfield caption="End of Conversion Interrupt Disable 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Disable 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Disable 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Disable 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Disable 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Disable 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Disable 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Disable 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="End of Conversion Interrupt Disable 8" mask="0x00000100" name="EOC8"/>
          <bitfield caption="End of Conversion Interrupt Disable 9" mask="0x00000200" name="EOC9"/>
          <bitfield caption="End of Calibration Sequence" mask="0x00800000" name="EOCAL"/>
          <bitfield caption="Data Ready Interrupt Disable" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Disable" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Disable" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of Receive Buffer Interrupt Disable" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x10000000" name="RXBUFF"/>
        </register>
