Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4SP32A.xml
        <register caption="Interrupt Mask Register" name="ADC_IMR" offset="0x2C" rw="R" size="4">
          <bitfield caption="End of Conversion Interrupt Mask 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Mask 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Mask 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Mask 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Mask 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Mask 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Mask 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Mask 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="End of Conversion Interrupt Mask 8" mask="0x00000100" name="EOC8"/>
          <bitfield caption="End of Conversion Interrupt Mask 9" mask="0x00000200" name="EOC9"/>
          <bitfield caption="End of Calibration Sequence" mask="0x00800000" name="EOCAL"/>
          <bitfield caption="Data Ready Interrupt Mask" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Mask" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Mask" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of Receive Buffer Interrupt Mask" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask" mask="0x10000000" name="RXBUFF"/>
        </register>
        <register caption="Interrupt Status Register" name="ADC_ISR" offset="0x30" rw="R" size="4">
          <bitfield caption="End of Conversion 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="End of Conversion 8" mask="0x00000100" name="EOC8"/>
          <bitfield caption="End of Conversion 9" mask="0x00000200" name="EOC9"/>
          <bitfield caption="End of Calibration Sequence" mask="0x00800000" name="EOCAL"/>
          <bitfield caption="Data Ready" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Error" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of RX Buffer" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="RX Buffer Full" mask="0x10000000" name="RXBUFF"/>
        </register>
        <register caption="Overrun Status Register" name="ADC_OVER" offset="0x3C" rw="R" size="4">
          <bitfield caption="Overrun Error 0" mask="0x00000001" name="OVRE0"/>
          <bitfield caption="Overrun Error 1" mask="0x00000002" name="OVRE1"/>
          <bitfield caption="Overrun Error 2" mask="0x00000004" name="OVRE2"/>
          <bitfield caption="Overrun Error 3" mask="0x00000008" name="OVRE3"/>
          <bitfield caption="Overrun Error 4" mask="0x00000010" name="OVRE4"/>
          <bitfield caption="Overrun Error 5" mask="0x00000020" name="OVRE5"/>
          <bitfield caption="Overrun Error 6" mask="0x00000040" name="OVRE6"/>
          <bitfield caption="Overrun Error 7" mask="0x00000080" name="OVRE7"/>
          <bitfield caption="Overrun Error 8" mask="0x00000100" name="OVRE8"/>
          <bitfield caption="Overrun Error 9" mask="0x00000200" name="OVRE9"/>
        </register>
        <register caption="Extended Mode Register" name="ADC_EMR" offset="0x40" rw="RW" size="4">
          <bitfield caption="Comparison Mode" mask="0x00000003" name="CMPMODE" values="ADC_EMR__CMPMODE"/>
          <bitfield caption="Comparison Selected Channel" mask="0x000000F0" name="CMPSEL"/>
          <bitfield caption="Compare All Channels" mask="0x00000200" name="CMPALL"/>
          <bitfield caption="TAG of the ADC_LDCR register" mask="0x01000000" name="TAG"/>
        </register>
        <register caption="Compare Window Register" name="ADC_CWR" offset="0x44" rw="RW" size="4">
          <bitfield caption="Low Threshold" mask="0x00000FFF" name="LOWTHRES"/>
          <bitfield caption="High Threshold" mask="0x0FFF0000" name="HIGHTHRES"/>
        </register>
        <register caption="Channel Gain Register" name="ADC_CGR" offset="0x48" rw="RW" size="4">
          <bitfield caption="Gain for channel 0" mask="0x00000003" name="GAIN0"/>
          <bitfield caption="Gain for channel 1" mask="0x0000000C" name="GAIN1"/>
          <bitfield caption="Gain for channel 2" mask="0x00000030" name="GAIN2"/>
          <bitfield caption="Gain for channel 3" mask="0x000000C0" name="GAIN3"/>
          <bitfield caption="Gain for channel 4" mask="0x00000300" name="GAIN4"/>
          <bitfield caption="Gain for channel 5" mask="0x00000C00" name="GAIN5"/>
          <bitfield caption="Gain for channel 6" mask="0x00003000" name="GAIN6"/>
          <bitfield caption="Gain for channel 7" mask="0x0000C000" name="GAIN7"/>
          <bitfield caption="Gain for channel 8" mask="0x00030000" name="GAIN8"/>
          <bitfield caption="Gain for channel 9" mask="0x000C0000" name="GAIN9"/>
        </register>
        <register caption="Channel Offset Register" name="ADC_COR" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Offset for channel 0" mask="0x00000001" name="OFF0"/>
          <bitfield caption="Offset for channel 1" mask="0x00000002" name="OFF1"/>
          <bitfield caption="Offset for channel 2" mask="0x00000004" name="OFF2"/>
          <bitfield caption="Offset for channel 3" mask="0x00000008" name="OFF3"/>
          <bitfield caption="Offset for channel 4" mask="0x00000010" name="OFF4"/>
          <bitfield caption="Offset for channel 5" mask="0x00000020" name="OFF5"/>
          <bitfield caption="Offset for channel 6" mask="0x00000040" name="OFF6"/>
          <bitfield caption="Offset for channel 7" mask="0x00000080" name="OFF7"/>
          <bitfield caption="Offset for channel 8" mask="0x00000100" name="OFF8"/>
          <bitfield caption="Offset for channel 9" mask="0x00000200" name="OFF9"/>
          <bitfield caption="Differential inputs for channel 0" mask="0x00010000" name="DIFF0"/>
          <bitfield caption="Differential inputs for channel 1" mask="0x00020000" name="DIFF1"/>
          <bitfield caption="Differential inputs for channel 2" mask="0x00040000" name="DIFF2"/>
          <bitfield caption="Differential inputs for channel 3" mask="0x00080000" name="DIFF3"/>
          <bitfield caption="Differential inputs for channel 4" mask="0x00100000" name="DIFF4"/>
          <bitfield caption="Differential inputs for channel 5" mask="0x00200000" name="DIFF5"/>
          <bitfield caption="Differential inputs for channel 6" mask="0x00400000" name="DIFF6"/>
          <bitfield caption="Differential inputs for channel 7" mask="0x00800000" name="DIFF7"/>
          <bitfield caption="Differential inputs for channel 8" mask="0x01000000" name="DIFF8"/>
          <bitfield caption="Differential inputs for channel 9" mask="0x02000000" name="DIFF9"/>
        </register>
        <register caption="Channel Data Register 0" name="ADC_CDR0" offset="0x50" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 1" name="ADC_CDR1" offset="0x54" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 2" name="ADC_CDR2" offset="0x58" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 3" name="ADC_CDR3" offset="0x5C" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 4" name="ADC_CDR4" offset="0x60" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
