Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4SP32A.xml
      <value-group caption="" name="EEFC_FCR__FKEY">
        <value caption="The 0x5A value enables the command defined by the bits of the register. If the field is written with a different value, the write is not performed and no action is started." name="PASSWD" value="0x5A"/>
      </value-group>
    </module>
    <module caption="General Purpose Backup Register" name="GPBR" version="6378D">
      <register-group name="GPBR">
        <register caption="General Purpose Backup Register 0" name="SYS_GPBR0" offset="0x0" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 1" name="SYS_GPBR1" offset="0x4" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 2" name="SYS_GPBR2" offset="0x8" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 3" name="SYS_GPBR3" offset="0xC" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 4" name="SYS_GPBR4" offset="0x10" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 5" name="SYS_GPBR5" offset="0x14" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 6" name="SYS_GPBR6" offset="0x18" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
        <register caption="General Purpose Backup Register 7" name="SYS_GPBR7" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Value of GPBR x" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
      </register-group>
    </module>
    <module caption="AHB Bus Matrix" name="MATRIX" version="6499A">
      <register-group name="MATRIX">
        <register caption="Master Configuration Register 0" name="MATRIX_MCFG0" offset="0x0" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Master Configuration Register 1" name="MATRIX_MCFG1" offset="0x4" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Master Configuration Register 2" name="MATRIX_MCFG2" offset="0x8" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Master Configuration Register 3" name="MATRIX_MCFG3" offset="0xC" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Slave Configuration Register 0" name="MATRIX_SCFG0" offset="0x40" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 1" name="MATRIX_SCFG1" offset="0x44" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 2" name="MATRIX_SCFG2" offset="0x48" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 3" name="MATRIX_SCFG3" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 4" name="MATRIX_SCFG4" offset="0x50" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Priority Register A for Slave 0" name="MATRIX_PRAS0" offset="0x0080" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
        </register>
