Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4SP32A.xml
        <register caption="Receive Next Pointer Register" name="SSC_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="SSC_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="SSC_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="SSC_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="SSC_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="SSC_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
      <value-group caption="" name="SSC_RCMR__CKS">
        <value caption="Divided Clock" name="MCK" value="0x0"/>
        <value caption="TK Clock signal" name="TK" value="0x1"/>
        <value caption="RK pin" name="RK" value="0x2"/>
      </value-group>
      <value-group caption="" name="SSC_RCMR__CKO">
        <value caption="None, RK pin is an input" name="NONE" value="0x0"/>
        <value caption="Continuous Receive Clock, RK pin is an output" name="CONTINUOUS" value="0x1"/>
        <value caption="Receive Clock only during data transfers, RK pin is an output" name="TRANSFER" value="0x2"/>
      </value-group>
      <value-group caption="" name="SSC_RCMR__CKG">
        <value caption="None" name="CONTINUOUS" value="0x0"/>
        <value caption="Receive Clock enabled only if RF Pin is Low" name="EN_RF_LOW" value="0x1"/>
        <value caption="Receive Clock enabled only if RF Pin is High" name="EN_RF_HIGH" value="0x2"/>
      </value-group>
      <value-group caption="" name="SSC_RCMR__START">
        <value caption="Continuous, as soon as the receiver is enabled, and immediately after the end of transfer of the previous data." name="CONTINUOUS" value="0x0"/>
        <value caption="Transmit start" name="TRANSMIT" value="0x1"/>
        <value caption="Detection of a low level on RF signal" name="RF_LOW" value="0x2"/>
        <value caption="Detection of a high level on RF signal" name="RF_HIGH" value="0x3"/>
        <value caption="Detection of a falling edge on RF signal" name="RF_FALLING" value="0x4"/>
        <value caption="Detection of a rising edge on RF signal" name="RF_RISING" value="0x5"/>
        <value caption="Detection of any level change on RF signal" name="RF_LEVEL" value="0x6"/>
        <value caption="Detection of any edge on RF signal" name="RF_EDGE" value="0x7"/>
        <value caption="Compare 0" name="CMP_0" value="0x8"/>
      </value-group>
      <value-group caption="" name="SSC_RFMR__FSOS">
        <value caption="None, RF pin is an input" name="NONE" value="0x0"/>
        <value caption="Negative Pulse, RF pin is an output" name="NEGATIVE" value="0x1"/>
        <value caption="Positive Pulse, RF pin is an output" name="POSITIVE" value="0x2"/>
        <value caption="Driven Low during data transfer, RF pin is an output" name="LOW" value="0x3"/>
        <value caption="Driven High during data transfer, RF pin is an output" name="HIGH" value="0x4"/>
        <value caption="Toggling at each start of data transfer, RF pin is an output" name="TOGGLING" value="0x5"/>
      </value-group>
      <value-group caption="" name="SSC_RFMR__FSEDGE">
        <value caption="Positive Edge Detection" name="POSITIVE" value="0"/>
        <value caption="Negative Edge Detection" name="NEGATIVE" value="1"/>
      </value-group>
      <value-group caption="" name="SSC_TCMR__CKS">
        <value caption="Divided Clock" name="MCK" value="0x0"/>
        <value caption="RK Clock signal" name="RK" value="0x1"/>
        <value caption="TK pin" name="TK" value="0x2"/>
      </value-group>
      <value-group caption="" name="SSC_TCMR__CKO">
        <value caption="None, TK pin is an input" name="NONE" value="0x0"/>
        <value caption="Continuous Transmit Clock, TK pin is an output" name="CONTINUOUS" value="0x1"/>
        <value caption="Transmit Clock only during data transfers, TK pin is an output" name="TRANSFER" value="0x2"/>
      </value-group>
      <value-group caption="" name="SSC_TCMR__CKG">
        <value caption="None" name="CONTINUOUS" value="0x0"/>
        <value caption="Transmit Clock enabled only if TF pin is Low" name="EN_TF_LOW" value="0x1"/>
        <value caption="Transmit Clock enabled only if TF pin is High" name="EN_TF_HIGH" value="0x2"/>
      </value-group>
      <value-group caption="" name="SSC_TCMR__START">
        <value caption="Continuous, as soon as a word is written in the SSC_THR Register (if Transmit is enabled), and immediately after the end of transfer of the previous data." name="CONTINUOUS" value="0x0"/>
        <value caption="Receive start" name="RECEIVE" value="0x1"/>
        <value caption="Detection of a low level on TF signal" name="TF_LOW" value="0x2"/>
        <value caption="Detection of a high level on TF signal" name="TF_HIGH" value="0x3"/>
        <value caption="Detection of a falling edge on TF signal" name="TF_FALLING" value="0x4"/>
        <value caption="Detection of a rising edge on TF signal" name="TF_RISING" value="0x5"/>
        <value caption="Detection of any level change on TF signal" name="TF_LEVEL" value="0x6"/>
        <value caption="Detection of any edge on TF signal" name="TF_EDGE" value="0x7"/>
      </value-group>
      <value-group caption="" name="SSC_TFMR__FSOS">
        <value caption="None, TF pin is an input" name="NONE" value="0x0"/>
        <value caption="Negative Pulse, TF pin is an output" name="NEGATIVE" value="0x1"/>
        <value caption="Positive Pulse,TF pin is an output" name="POSITIVE" value="0x2"/>
        <value caption="TF pin Driven Low during data transfer" name="LOW" value="0x3"/>
        <value caption="TF pin Driven High during data transfer" name="HIGH" value="0x4"/>
        <value caption="TF pin Toggles at each start of data transfer" name="TOGGLING" value="0x5"/>
      </value-group>
